app/controllers/api/v1/comments_controller.rb

      def create
        user = User.find_by(token: params[:user_token])
        project = Project.find(comment_params[:project_id])
        if user && project
          @comment = Comment.new(text: comment_params[:text], user_id: user.id, project_id: project.id, created_at: Date.today)
          if @comment.save
---
SELECT  "users".* FROM "users" WHERE "users"."token" = $1 LIMIT $2  [["token", "Best$2a$12$p2nmTdKbYo7eV3.STHrzNuug7XwqmbcPPlumWuwoSRxVk4RnoyCtu"], ["LIMIT", 1]]
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("text", "project_id", "user_id", "created_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["text", "e"], ["project_id", 1], ["user_id", 2], ["created_at", "2019-12-03 16:57:02.511613"]]

      def set_comment_with_user_token
        user = User.find_by(token: params[:user_token])
        if user && user.role == 'admin'
          @comment = Comment.find_by(project_id: params[:project_id])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."project_id" = $1 LIMIT $2  [["project_id", 1], ["LIMIT", 1]]