app/controllers/api/v1/payments_controller.rb

SELECT  "payments".* FROM "payments" WHERE "payments"."project_id" = $1 LIMIT $2  [["project_id", 1], ["LIMIT", 1]]
---
      def index
        payment = Payment.find_by(project_id: payment_params[:project_id])