app/controllers/api/v1/projects_controller.rb

  def index
    render json: { success: true, errors: {}, result: { projects: serialize_resource(Project.all)} }
---
SELECT "projects".* FROM "projects"