app/controllers/api/v1/projects_controller.rb

      def create
        @project = Project.new(title: project_params[:title],
                               description: project_params[:description],
                               end_time: project_params[:end_time],
                               sum_goal: project_params[:sum_goal],
                               current_sum: project_params[:current_sum],
                               image_url: project_params[:image_url],
                               owner: User.find_by(token: project_params[:user_token]),
                               categories: Category.find(project_params[:categories_id]))
        if @project.save
---
SELECT  "users".* FROM "users" WHERE "users"."token" = $1 LIMIT $2  [["token", "Best$2a$12$p2nmTdKbYo7eV3.STHrzNuug7XwqmbcPPlumWuwoSRxVk4RnoyCtu"], ["LIMIT", 1]]
INSERT INTO "projects" ("title", "description", "end_time", "sum_goal", "current_sum", "user_id", "created_at", "updated_at", "image_url") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

      def update
        if @project
          if @project.update(project_params_for_update)
---
UPDATE "projects" SET "title" = $1, "updated_at" = $2 WHERE "projects"."id" = $3  [["title", "new title"], ["updated_at", "2019-11-17 11:06:14.513655"], ["id", 15]]

      def destroy
        if @project
          if @project.delete
---
DELETE FROM "projects" WHERE "projects"."id" = $1  [["id", 52]]

      def find_project_with_filters
        ActiveRecord::Base.transaction do
          @projects = Project.all
          @projects = @projects.where('title LIKE ?', "%#{params[:title]}%") if params[:title].present?
          @projects = @projects.where('description LIKE ?', "%#{params[:description]}%") if params[:description].present?
          @projects = @projects.where('end_time < ?', params[:end_time]) if params[:end_time].present?
          @projects = find_project_with_category(eval(params[:categories_id])) if params[:categories_id].present?
---
SELECT  "projects".* FROM "projects" LIMIT $1  [["LIMIT", 1]]
SELECT  "projects".* FROM "projects" WHERE "projects"."title" = $1 LIMIT $2  [["title", "title"], ["LIMIT", 1]]
SELECT "projects".* FROM "projects" WHERE "projects"."id" IN ($1, $2, $3)  [["id", 1], ["id", 2], ["id", 3]]

      def find_project_with_category(category_ids)
        projects = []
        @projects.each do |project|
          next unless (project.category_ids - category_ids).count < project.category_ids.count

          projects << project
---
INSERT INTO "projects" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "first"], ["description", "desc"], ["user_id", 1], ["created_at", "2019-11-18 18:46:32.459604"], ["updated_at", "2019-11-18 18:46:32.459604"]]

      def set_project_with_user_token
        user = User.find_by(token: params[:user_token])
        if user && user.role == 'admin'
          @project = Project.find_by(id: params[:id])
        else
          @project = Project.find_by(id: params[:id], owner: user)
---
SELECT  "users".* FROM "users" WHERE "users"."token" = $1 LIMIT $2  [["token", "Best$2a$12$LyHG99ZxWIVQHfpr07OkiebT5dIzWg7pTlPysfvWyvjRuVzhFpf5C"], ["LIMIT", 1]]
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 AND "projects"."user_id" = $2 LIMIT $3  [["id", 52], ["user_id", 53], ["LIMIT", 1]]