app/controllers/api/v1/users_controller.rb

      def create
        @user = User.new(email: user_params[:email],
                         login: user_params[:login],
                         birthday: user_params[:birthday],
                         first_name: user_params[:first_name],
                         middle_name: user_params[:middle_name],
                         last_name: user_params[:last_name])
        @user.password = user_params[:password]
        if @user.save
---
INSERT INTO "users" ("name", "email", "encrypted_password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Maxim"], ["email", "example@email.com"], ["encrypted_password", "qwerty"], ["created_at", "2019-09-26 12:25:32.687743"], ["updated_at", "2019-09-26 12:25:32.687743"]]

      def update
        if @user
          if @user.update(user_params_for_update)
---
UPDATE "users" SET "middle_name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["middle_name", "new first name"], ["updated_at", "2019-11-19 20:30:12.436377"], ["id", 9]]

      def set_user_by_id
        @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]

      def set_user_by_login
        @user = User.find_by_login(user_params[:login])
---
SELECT  "users".* FROM "users" WHERE "users"."login" = $1 LIMIT $2  [["login", "Best"], ["LIMIT", 1]]

      def set_user_by_token
        @user = User.find_by(token: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."token" = $1 LIMIT $2  [["token", "1"], ["LIMIT", 1]]